package application.processor.input;

public class RandomData {
    static public final String[] maleNamesArray = {"Иван", "Артем", "Александр", "Сильвестр",  "Артур", "Максим", "Григорий", "Ефим", "Джон", "Алексей",
            "Доминик", "Василий", "Олег", "Акакий", "Сергей", "Николай", "Тихон", "Илья", "Ильдар", "Святослав",
            "Стив", "Анатолий", "Ибрагим", "Такуми", "Чарли", "Шаман", "Брайан", "Константин", "Евгений", "Шон", "Владимир"};
    static public final String[] womenNamesArray = {"Ольга", "Алина", "Светлана", "Анастасия", "Анжелика", "Ева", "Мадонна", "Виктория", "Елена", "Наталья",
            "Амелия", "Василиса", "Алена", "Ангелина", "Алла", "Оксана", "Летти", "Нацуки", "Карина", "Яна",
            "Милена", "Валерия", "Ирина", "Дарья", "Анна", "Полина", "Екатерина", "Алиса", "Мария", "Галина", "Моника", "Александра"};
    static public final String[] maleLastNamesArray = {"Иванов", "Колесников", "Сталоне", "Шварцнегер", "Кочетков", "Шумилов", "Серов", "Фудживара", "Торетто", "Полежайкин",
            "Ахмедов", "Абубакиров", "Квасов", "Корзюков", "Нигреев", "Золо", "Пушкин", "Татарников", "Крамарчук", "Трамп",
            "Белозеров", "Батайкин", "Тихонов", "Данилец", "Рахматулин", "Батурин", "Домрачев", "Сухарев", "Гринкин", "Соловьев", "Мазуров"};
    static public final String[] womenLastNamesArray = {"Иванова", "Колесникова", "Сталоне", "Шварцнегер", "Кочеткова", "Шумилова", "Серова", "Фудживара", "Торетто", "Полежайкина",
            "Ахмедова", "Абубакирова", "Квасова", "Корзюкова", "Нигреева", "Золо", "Пушкина", "Татарникова", "Крамарчук", "Трамп",
            "Белозерова", "Батайкина", "Тихонова", "Данилец", "Рахматулина", "Батурина", "Домрачева", "Сухарева", "Гринкина", "Соловьева", "Мазурова"};
}
